experiments/socialnetwork_singlenode/expected_results/mixed_qps5500/wrk.log
Running 2m test @ http://ip-172-31-2-175.us-east-2.compute.internal:8080
  4 threads and 64 connections
  Thread calibration: mean lat.: 4.426ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 4.414ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 4.430ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 4.389ms, rate sampling interval: 16ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.24ms    2.64ms  52.77ms   76.88%
    Req/Sec     1.42k   153.46     2.20k    70.84%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.06ms
 75.000%    6.30ms
 90.000%    8.18ms
 99.000%   11.36ms
 99.900%   17.84ms
 99.990%   34.08ms
 99.999%   47.71ms
100.000%   52.80ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.769     0.000000            1         1.00
       1.960     0.100000        77006         1.11
       2.263     0.200000       154183         1.25
       2.519     0.300000       230909         1.43
       2.773     0.400000       307832         1.67
       3.063     0.500000       385142         2.00
       3.239     0.550000       423515         2.22
       3.463     0.600000       461745         2.50
       3.821     0.650000       500288         2.86
       5.147     0.700000       538720         3.33
       6.299     0.750000       577358         4.00
       6.619     0.775000       596409         4.44
       6.923     0.800000       615846         5.00
       7.211     0.825000       634898         5.71
       7.511     0.850000       654197         6.67
       7.831     0.875000       673434         8.00
       7.999     0.887500       683036         8.89
       8.183     0.900000       692682        10.00
       8.383     0.912500       702375        11.43
       8.607     0.925000       712061        13.33
       8.863     0.937500       721503        16.00
       9.015     0.943750       726403        17.78
       9.175     0.950000       731086        20.00
       9.367     0.956250       735976        22.86
       9.575     0.962500       740818        26.67
       9.815     0.968750       745615        32.00
       9.951     0.971875       748021        35.56
      10.095     0.975000       750338        40.00
      10.271     0.978125       752810        45.71
      10.463     0.981250       755165        53.33
      10.719     0.984375       757590        64.00
      10.863     0.985938       758762        71.11
      11.031     0.987500       759961        80.00
      11.223     0.989062       761162        91.43
      11.447     0.990625       762353       106.67
      11.711     0.992188       763556       128.00
      11.879     0.992969       764152       142.22
      12.071     0.993750       764762       160.00
      12.287     0.994531       765349       182.86
      12.583     0.995313       765972       213.33
      12.927     0.996094       766554       256.00
      13.135     0.996484       766858       284.44
      13.375     0.996875       767154       320.00
      13.695     0.997266       767456       365.71
      14.111     0.997656       767754       426.67
      14.687     0.998047       768053       512.00
      15.079     0.998242       768205       568.89
      15.591     0.998437       768355       640.00
      16.223     0.998633       768505       731.43
      17.071     0.998828       768657       853.33
      17.983     0.999023       768809      1024.00
      18.607     0.999121       768882      1137.78
      19.551     0.999219       768955      1280.00
      20.735     0.999316       769030      1462.86
      22.255     0.999414       769106      1706.67
      23.695     0.999512       769181      2048.00
      24.399     0.999561       769218      2275.56
      25.263     0.999609       769257      2560.00
      26.367     0.999658       769293      2925.71
      27.263     0.999707       769332      3413.33
      28.463     0.999756       769370      4096.00
      29.119     0.999780       769387      4551.11
      29.823     0.999805       769406      5120.00
      30.543     0.999829       769425      5851.43
      31.775     0.999854       769444      6826.67
      33.215     0.999878       769463      8192.00
      33.663     0.999890       769472      9102.22
      34.143     0.999902       769481     10240.00
      35.007     0.999915       769491     11702.86
      36.191     0.999927       769500     13653.33
      36.831     0.999939       769510     16384.00
      37.919     0.999945       769514     18204.44
      38.303     0.999951       769519     20480.00
      38.943     0.999957       769524     23405.71
      40.959     0.999963       769528     27306.67
      41.727     0.999969       769533     32768.00
      42.431     0.999973       769535     36408.89
      43.423     0.999976       769538     40960.00
      43.711     0.999979       769540     46811.43
      44.799     0.999982       769542     54613.33
      46.079     0.999985       769546     65536.00
      46.079     0.999986       769546     72817.78
      47.391     0.999988       769547     81920.00
      47.711     0.999989       769548     93622.86
      47.967     0.999991       769549    109226.67
      48.991     0.999992       769551    131072.00
      48.991     0.999993       769551    145635.56
      49.919     0.999994       769552    163840.00
      49.919     0.999995       769552    187245.71
      51.231     0.999995       769553    218453.33
      52.351     0.999996       769554    262144.00
      52.351     0.999997       769554    291271.11
      52.351     0.999997       769554    327680.00
      52.351     0.999997       769554    374491.43
      52.607     0.999998       769555    436906.67
      52.607     0.999998       769555    524288.00
      52.607     0.999998       769555    582542.22
      52.607     0.999998       769555    655360.00
      52.607     0.999999       769555    748982.86
      52.799     0.999999       769556    873813.33
      52.799     1.000000       769556          inf
#[Mean    =        4.243, StdDeviation   =        2.636]
#[Max     =       52.768, Total count    =       769556]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    2.27ms
 75.000%    5.61ms
 90.000%    7.38ms
 99.000%   10.40ms
 99.900%   14.57ms
 99.990%   25.77ms
 99.999%   35.84ms
100.000%   38.05ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.674     0.000000            1         1.00
       1.424     0.100000        76981         1.11
       1.649     0.200000       154113         1.25
       1.838     0.300000       230956         1.43
       2.034     0.400000       307944         1.67
       2.273     0.500000       385246         2.00
       2.425     0.550000       423492         2.22
       2.625     0.600000       461742         2.50
       2.943     0.650000       500242         2.86
       4.479     0.700000       538707         3.33
       5.607     0.750000       577278         4.00
       5.907     0.775000       596485         4.44
       6.183     0.800000       615695         5.00
       6.463     0.825000       634936         5.71
       6.743     0.850000       654309         6.67
       7.043     0.875000       673464         8.00
       7.207     0.887500       683072         8.89
       7.383     0.900000       692604        10.00
       7.579     0.912500       702289        11.43
       7.791     0.925000       711871        13.33
       8.043     0.937500       721469        16.00
       8.191     0.943750       726365        17.78
       8.351     0.950000       731209        20.00
       8.527     0.956250       735987        22.86
       8.727     0.962500       740877        26.67
       8.951     0.968750       745593        32.00
       9.079     0.971875       747924        35.56
       9.231     0.975000       750351        40.00
       9.399     0.978125       752818        45.71
       9.591     0.981250       755219        53.33
       9.815     0.984375       757606        64.00
       9.951     0.985938       758795        71.11
      10.103     0.987500       759951        80.00
      10.287     0.989062       761185        91.43
      10.487     0.990625       762364       106.67
      10.735     0.992188       763558       128.00
      10.879     0.992969       764155       142.22
      11.047     0.993750       764767       160.00
      11.239     0.994531       765351       182.86
      11.479     0.995313       765952       213.33
      11.759     0.996094       766567       256.00
      11.943     0.996484       766858       284.44
      12.127     0.996875       767155       320.00
      12.359     0.997266       767453       365.71
      12.655     0.997656       767759       426.67
      12.991     0.998047       768055       512.00
      13.191     0.998242       768205       568.89
      13.455     0.998437       768363       640.00
      13.743     0.998633       768504       731.43
      14.127     0.998828       768658       853.33
      14.639     0.999023       768805      1024.00
      14.903     0.999121       768881      1137.78
      15.223     0.999219       768957      1280.00
      15.551     0.999316       769031      1462.86
      15.943     0.999414       769107      1706.67
      16.479     0.999512       769182      2048.00
      16.751     0.999561       769218      2275.56
      17.119     0.999609       769256      2560.00
      17.423     0.999658       769293      2925.71
      18.063     0.999707       769332      3413.33
      18.751     0.999756       769369      4096.00
      19.247     0.999780       769387      4551.11
      20.015     0.999805       769407      5120.00
      21.135     0.999829       769425      5851.43
      22.479     0.999854       769445      6826.67
      24.127     0.999878       769464      8192.00
      25.503     0.999890       769472      9102.22
      25.887     0.999902       769481     10240.00
      26.767     0.999915       769491     11702.86
      27.487     0.999927       769500     13653.33
      28.127     0.999939       769510     16384.00
      28.847     0.999945       769515     18204.44
      29.007     0.999951       769519     20480.00
      29.295     0.999957       769524     23405.71
      30.191     0.999963       769528     27306.67
      31.951     0.999969       769533     32768.00
      32.367     0.999973       769535     36408.89
      33.183     0.999976       769538     40960.00
      33.279     0.999979       769540     46811.43
      33.599     0.999982       769542     54613.33
      34.783     0.999985       769545     65536.00
      35.199     0.999986       769546     72817.78
      35.743     0.999988       769547     81920.00
      35.839     0.999989       769548     93622.86
      35.967     0.999991       769549    109226.67
      36.127     0.999992       769551    131072.00
      36.127     0.999993       769551    145635.56
      36.511     0.999994       769552    163840.00
      36.511     0.999995       769552    187245.71
      37.119     0.999995       769553    218453.33
      37.215     0.999996       769554    262144.00
      37.215     0.999997       769554    291271.11
      37.215     0.999997       769554    327680.00
      37.215     0.999997       769554    374491.43
      37.951     0.999998       769555    436906.67
      37.951     0.999998       769555    524288.00
      37.951     0.999998       769555    582542.22
      37.951     0.999998       769555    655360.00
      37.951     0.999999       769555    748982.86
      38.047     0.999999       769556    873813.33
      38.047     1.000000       769556          inf
#[Mean    =        3.520, StdDeviation   =        2.513]
#[Max     =       38.016, Total count    =       769556]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  824801 requests in 2.50m, 318.56MB read
Requests/sec:   5498.69
Transfer/sec:      2.12MB